Repository: blagojabozinovski/ckanext-validation
Catalog: ckanext/validation/i18n/*/LC_MESSAGES/ckanext-validation.po
Languages: mk, sq

source: Unauthorized to read this validation report
mk: Не сте авторизирани за да го погледнете извештајот од валидација.
sq: I paautorizuar për të lexuar këtë raport validimi

source: No validation report exists for this resource
mk: Не постои извештај од валидација за овој ресурс
sq: Nuk ekziston një raport validimi për këtë burim

source: success
mk: валидни
sq: sukses

source: failure
mk: погрешни
sq: dështim

source: invalid
mk: невалидни
sq: I pavlefshëm

source: error
mk: погрешни
sq: gabim

source: unknown
mk: непознати
sq: i panjohur

source: Valid data
mk: Валидни податоци
sq: Të dhënat e vlefshme

source: Invalid data
mk: Невалидни податоци
sq: Të dhënat e pavlefshme

source: Error during validation
mk: Грешка при валидација
sq: Gabim gjatë validimit

source: Data validation unknown
mk: Непозната валидација на податоци
sq: Validimi i i të dhënave është i panjohur

source: data
mk: податоците се
sq: të dhëna

source: There are validation issues with this file, please see the <a {params}>report</a> for details. Once you have resolved the issues, click the button below to replace the file.
mk: Постојат грешки при валидација на оваа датотека, Ве молиме погледнете го <a {params}>извештајот</a> за детали. Штом ги поправивте грешките, кликнете на подолното копче за да ја заменете датотеката.
sq: Ka probleme të validimit me këtë skedar, ju lutem shikoni <a {params}>rarort</a> për detajet. Pasi ta keni zgjidhur problemin, klikoni butonin më poshtë për ta zëvendësuar skedarin.

source: Resource was not found.
mk: Ресурсот не беше пронајден.
sq: Burimi nuk u gjet.

source: Upload
mk: Прикачете
sq: Ngarkoni

source: Upload a Data Schema file from your computer
mk: Прикачете датотека од вашиот компјутер која содржи податочна шема
sq: Ngarko një skedar të skemës së të dhënave nga kompjuteri yt

source: Link
mk: Линк
sq: Link (Lidhje)

source: URL for a Data Schema file available on the Internet
mk: Линк до датотека која содржи податочна шема достапна на Интернет
sq: URL-ja për skedarin e skemës së të dhënave e disponueshme në internet

source: Enter manually a Table Schema JSON object
mk: Внесете рачно JSON објект која содржи табеларна шема
sq: Fusni manualisht një skemë të Tabelës JSON objekt

source: Clear
mk: Отстранете
sq: Qartë

source: Data Schema
mk: Податочна шема
sq: Skema e të Dhënave

source: Data Schema URL
mk: URL до податочна шема
sq: URL-ja e skemës së të dhënave

source: Uploaded Data Schema
mk: Прикачена податочна шема
sq: Skema e të dhënave të ngarkuara

source: There are
mk: Постојат
sq: Ka

source: warning(s)
mk: предупредувањa
sq: paralajmërim

source: Warning details
mk: Детали за грешка
sq: Detajet e paralajmërimit

source: valid table(s)
mk: валидни табели
sq: tabela e vlefshme

source: Success details
mk: Детали за валидност
sq: Detajet e suksesit

source: Invalid
mk: Невалидни
sq: I pavlefshëm

source: Error details
mk: Детали за грешка
sq: Detajet e gabimit

source: Show next 10 rows
mk: Прикажи ги следните 10 редови
sq: Shfaq 10 rreshtat e ardhshëm

source: Please report this to https://github.com/chjj/marked.
mk: Ве молиме пријавете го ова на https://github.com/chjj/marked.
sq: Ju lutemi raportoni këtë tek https://github.com/chjj/marked.

source: IO Error
mk: IO грешка
sq: IO Gabim

source: The data source returned an IO Error of type {error_type}
mk: Изворот на податоци вратил IO грешка од типот {error_type}
sq: Burimi i të dhënave ka rikthyer një Gabim IO të llojit {error_type}

source: Data reading error because of IO error. How it could be resolved: - Fix path if it's not correct.
mk: Грешка при читање податоци поради IO грешка. Како може да се реши: - Поправете ја патеката ако не е точна.
sq: Gabim gjatë leximit të të dhënave për shkak të gabimit të IO. Si mund të zgjidhet: - Rregullo rrugën nëse nuk është e saktë.

source: HTTP Error
mk: HTTP грешка
sq: HTTP e gabuar

source: The data source returned an HTTP error with a status code of {status_code}
mk: Изворот на податоци врати HTTP-грешка со статус код {status_code}
sq: Burimi i të dhënave ka rikthyer një gabim HTTP me kodin e statusit të {status_code}

source: Data reading error because of HTTP error. How it could be resolved: - Fix url link if it's not correct.
mk: Грешка при читање податоци поради HTTP грешка. Како може да се реши: - Поправете ја URL врската ако не е точна.
sq: Gabim gjatë leximit të të dhënave për shkak të gabimit HTTP. Si mund të zgjidhet: - Rregullo url link-un nëse nuk është e saktë.

source: Source Error
mk: Изворна грешка
sq: Burim i gabuar

source: The data source has not supported or has inconsistent contents; no tabular data can be extracted
mk: Изворот на податоци не поддржа или има неконзистентни содржини; табеларните податоци не можат да се извадат
sq: Burimi i të dhënave nuk ka mbështetje ose ka përmbajtje të paqëndrueshme; nuk mund të nxirren të dhëna tabelare

source: Data reading error because of not supported or inconsistent contents. How it could be resolved: - Fix data contents (e.g. change JSON data to array or arrays/objects). - Set correct source settings in {validator}.
mk: Грешка при читање податоци поради недозволени или неконзистентни содржини. Како може да се реши: - Поправете ги содржините на податоци (на пример, промена на JSON податоци во низа или низи/објекти). - Поставете ги точните извори на поставки во {validator}.
sq: Gabim gjatë leximit të të dhënave për shkak të mungesës së mbështetjes ose të përmbajtjes jokonsistente. Si mund të zgjidhet: - Përcaktoni përmbajtjen e të dhënave (p.sh. ndryshoni të dhënat e JSON-it tek grupi ose grupet / objektet). - Vendosni cilësimet e sakta të burimit në {validator}.

source: Scheme Error
mk: Грешка на шемата
sq: Skemë e gabuar

source: The data source is in an unknown scheme; no tabular data can be extracted
mk: Изворот на податоци е во непозната шема; не може да се извадат табеларни податоци
sq: Burimi i të dhënave është në një skemë të panjohur; nuk mund të nxirren të dhëna tabelare

source: Data reading error because of incorrect scheme. How it could be resolved: - Fix data scheme (e.g. change scheme from `ftp` to `http`). - Set correct scheme in {validator}.
mk: Грешка при читање податоци поради неточна шема. Како може да се реши: - Поправете шема на податоци (на пример, променете ја шемата од `ftp` на `http`). - Поставете ја точната шема во {validator}.
sq: Gabim gjatë leximit të të dhënave për shkak të skemës së gabuar. Si mund të zgjidhet: - Përcaktoni përmbajtjen e skemës (p.sh. skema e ndryshimit nga `ftp` në` http`). - Vendosni skemën e saktë në {validator}.

source: Format Error
mk: Грешка во формат
sq: Format i gabuar

source: The data source is in an unknown format; no tabular data can be extracted
mk: Изворот на податоци е во непознат формат; не може да се извадат табеларни податоци
sq: Burimi i të dhënave është në një format të panjohur; nuk mund të nxirren të dhëna tabelare

source: Data reading error because of incorrect format. How it could be resolved: - Fix data format (e.g. change file extension from `txt` to `csv`). - Set correct format in {validator}.
mk: Грешка при читање податоци поради неточен формат. Како може да се реши: - Поправете формат на податоци (на пример, променете ја екстензијата на датотеката од `txt` во `csv`). - Поставете го точниот формат во {validator}.
sq: Gabim gjatë leximit të të dhënave për shkak të formatit të gabuar. Si mund të zgjidhet: - Përcaktoni përmbajtjen e skemës (p.sh. skema e ndryshimit nga `ftp` në` http`). - Vendosni formatin e saktë në {validator}.

source: Encoding Error
mk: Грешка при кодирање
sq: Gabim gjatë kodimit

source: The data source could not be successfully decoded with {encoding} encoding
mk: Изворот на податоци не може успешно да се декодира со {encoding} кодирање
sq: Burimi i të dhënave nuk mund të dekodohej me sukses me {encoding} kodimin

source: Data reading error because of an encoding problem. How it could be resolved: - Fix data source if it's broken. - Set correct encoding in {validator}.
mk: Грешка при читање податоци поради неточно кодирање. Како може да се реши: - Поправете извор на податоци ако е скршен - Поставете го точното кодирање во {validator}.
sq: Gabim gjatë leximit të të dhënave për shkak të një problemi me kodimin. Si mund të zgjidhet: - Përcaktoni burimin e të dhënave nëse është i prishur. - Vendosja e kodimit të saktë në {validator}.

source: Blank Header
mk: Празно заглавие
sq: Titulli i paplotësuar

source: structure
mk: структура
sq: Strukturë

source: Header in column {column_number} is blank
mk: Заглавието во колоната {column_number} е празно
sq: Titulli në kolonë {column_number} është i paplotësuar

source: A column in the header row is missing a value. Column names should be provided. How it could be resolved: - Add the missing column name to the first row of the data source. - If the first row starts with, or ends with a comma, remove it. - If this error should be ignored disable `blank-header` check in {validator}.
mk: Колоната во насловот на редот недостига вредност. Имињата на колоните треба да бидат дадени. Како може да се реши: - Додајте име на колона што недостасува во првиот ред од изворот на податоци. - Ако првиот ред започнува, или завршува со запирка, отстранете го. - Ако оваа грешка треба да се игнорира, оневозможете го "blank-header" проверете во {validator}.
sq: Në një kolonë në fillimin e rreshtit mungon vlera. Emri i kolonës duhet të sigurohet Si mund të zgjidhet: - Shto emrin e kolonës që mungon në rreshtin e parë të burimit të të dhënave. - Nëse fillon rreshti i parë ose përfundon me presje, hiqeni atë. - Nëse ky gabim duhet të injorohet, çaktivizoni `blank-header` check in {validator}.

source: Duplicate Header
mk: Дупликат заглавие
sq: Titulli i dubluar

source: Header in column {column_number} is duplicated to header in column(s) {column_numbers}
mk: Заглавието во колоната {column_number} се дуплицира во заглавието во колоните {column_numbers}
sq: Udhëheqësi në kolonën {column_number} është i dubluar në fillimin e kolonës {column_numbers}

source: Two columns in the header row have the same value. Column names should be unique. How it could be resolved: - Add the missing column name to the first row of the data. - If the first row starts with, or ends with a comma, remove it. - If this error should be ignored disable `duplicate-header` check in {validator}.
mk: Две колони во насловот на редот имаат иста вредност. Имињата на колоните треба да бидат единствени. Како може да се реши: - Додајте име на колона што недостасува во првиот ред од податоците. - Ако првиот ред започнува, или завршува со запирка, отстранете ја. - Ако оваа грешка треба да се игнорира, оневозможете го "duplicate-header" полето за избор {validator}.
sq: Dy kolona në fillimin e rreshtit kanë të njëjtën vlerë. Emrat e kolonës duhet të jenë unike. Si mund të zgjidhet: - Shto emrin e kolonës që mungon në rreshtin e parë të të dhënave. - Nëse fillon rreshti i parë ose përfundon me presje, hiqeni atë. - Nëse ky gabim duhet të injorohet, çaktivizo `blank-header` check in {validator}.

source: Blank Row
mk: Празен ред
sq: Rreshti i paplotësuar

source: Row {row_number} is completely blank
mk: Редот {row_number} е целосно празен
sq: Rreshti {row_number} është tërësisht i paplotësuar

source: This row is empty. A row should contain at least one value. How it could be resolved: - Delete the row. - If this error should be ignored disable `blank-row` check in {validator}.
mk: Овој ред е празен. Еден ред треба да содржи најмалку една вредност Како да се реши: - Избришете го редот. - Ако оваа грешка треба да се игнорира, оневозможете го `blank-row` полето за избор во {validator}.
sq: Ky rresht është i paplotësuar. Një rresht duhet të përmbajë të paktën një vlerë. Si mund të zgjidhet: - Fshi rreshtin. - Nëse ky gabim duhet të injorohet, çaktivizoni 'blank-row` check in {validator}.

source: Duplicate Row
mk: Дупликат ред
sq: Rresht i dubluar

source: Row {row_number} is duplicated to row(s) {row_numbers}
mk: Редот {row_number} е дупликат на редовите {row_numbers}
sq: Rreshti {row_number} është i dubluar në rreshtin {row_numbers}

source: The exact same data has been seen in another row. How it could be resolved: - If some of the data is incorrect, correct it. - If the whole row is an incorrect duplicate, remove it. - If this error should be ignored disable `duplicate-row` check in {validator}.
mk: Точно истите податоци може да се видат во друг ред. Како може да се реши: - Ако некои од податоците не се точни, исправте ги. - Ако целиот ред е погрешен дупликат, отстранете го. - Ако оваа грешка треба да се игнорира, оневозможете го `duplicate-row` полето за избор во {validator}.
sq: Të dhënat e njëjta të sakta janë parë në një rresht tjetër. Si mund të zgjidhet: - Nëse disa nga të dhënat janë të pasakta, korrigjoni ato. - Nëse i tërë rreshti është një dublim i pasaktë, hiqeni atë. - Nëse ky gabim duhet të injorohet, çaktivizoni në 'double-row` check in {validator}.

source: Extra Value
mk: Дополнителна вредност
sq: Vlera shtesë

source: Row
mk: Редот

source: has an extra value in column
mk: содржи дополнителна вредност во колоната

source: This row has more values compared to the header row (the first row in the data source). A key concept is that all the rows in tabular data must have the same number of columns. How it could be resolved: - Check data has an extra comma between the values in this row. - If this error should be ignored disable `extra-value` check in {validator}.
mk: Овој ред има повеќе вредности во споредба со заглавието (првиот ред во изворот на податоци). Клучниот концепт е дека сите редови во табеларните податоци мора да имаат ист број на колони. Како може да се реши: - Проверката на податоците има дополнителна запирка меѓу вредностите во овој ред. - Ако оваа грешка треба да се игнорира, оневозможете го "extra-value" полето за избор {validator}.
sq: Ky rresht ka më shumë vlera krahasuar me fillimin e rreshtit (rreshti i parë në burimin e të dhënave). Një koncept kryesor është se të gjitha rreshtat në të dhënat tabelare duhet të kenë të njëjtin numër kolonash. Si mund të zgjidhet: - Kontrollo të dhënat, ka një presje shtesë ndërmjet vlerave në këtë rresht. - Nëse ky gabim duhet të injorohet, çaktivizoni tek `extra-value` check in {validator}.

source: Missing Value
mk: Недостасува вредност
sq: Mungon vlera

source: Row {row_number} has a missing value in column {column_number}
mk: Редот {row_number} има вредност која недостасува во колоната {column_number}
sq: Rreshti {row_number} ka një vlerë që mungon në kolonën {column_number}

source: This row has less values compared to the header row (the first row in the data source). A key concept is that all the rows in tabular data must have the same number of columns. How it could be resolved: - Check data is not missing a comma between the values in this row. - If this error should be ignored disable `missing-value` check in {validator}.
mk: Овој ред има помалку вредности во споредба со заглавието (првиот ред во изворот на податоци). Клучниот концепт е дека сите редови во табеларните податоци мора да имаат ист број на колони. Како може да се реши: - Проверка на податоци не недостасува запирка меѓу вредностите во овој ред. - Ако оваа грешка треба да се игнорира оневозможете "missing-value" полето за избор во {validator}.
sq: Ky rresht ka më pak vlera krahasuar me fillimin e rreshtit (rreshti i parë në burimin e të dhënave). Një koncept kryesor është se të gjitha rreshtat në të dhënat tabelare duhet të kenë të njëjtin numër kolonash. Si mund të zgjidhet: - Kontrollo të dhënat, nuk mungon një presje ndërmjet vlerave në këtë rresht. - Nëse ky gabim duhet të injorohet,çaktivizoni missing-value` check in {validator}.

source: Table Schema Error
mk: Грешка во шемата
sq: Gabim i skemës së tabelës

source: schema
mk: шема
sq: Skema

source: Table Schema error: {error_message}
mk: Грешка во шемата: {error_message}
sq: Gabim i skemës së tabelës: {error_message}

source: Provided schema is not valid. How it could be resolved: - Update schema descriptor to be a valid descriptor - If this error should be ignored disable schema cheks in {validator}.
mk: Овој ред е празен. Еден ред треба да содржи најмалку една вредност Како да се реши: - Избришете го редот. - Ако оваа грешка треба да се игнорира, оневозможете го `blank-row` полето за избор во {validator}.
sq: Skema e ofruar nuk është e vlefshme. Si mund të zgjidhet: - Përditëso përshkrimin e skemës të jetë një përshkrim i vlefshëm - Nëse ky gabim duhet të injorohet, çaktivizoni kontrollimin e skemës në {validator}.

source: Non-Matching Header
mk: Несоодветно заглавје
sq: Titulli nuk përputhet

source: Header in column {column_number} doesn't match field name {field_name} in the schema
mk: Заглавјето во колоната {column_number} не се совпаѓа со името на полето {field_name} во шемата
sq: Titulli në kolonën {column_number} nuk përputhet me emrin e fushës {field_name} në skemën

source: One of the data source headers doesn't match the field name defined in the schema. How it could be resolved: - Rename header in the data source or field in the schema - If this error should be ignored disable `non-matching-header` check in {validator}.
mk: Еден од заглавијата на изворот на податоци не се совпаѓа со името на полето дефинирано во шемата. Како може да се реши: - Преименувај го заглавието во изворот на податоци или полето во шемата - Ако оваа грешка треба да се игнорира, оневозможете ја `non-matching-header` полето за избор во {validator}.
sq: Njëri nga titujt e burimit të të dhënave nuk përputhet me emrin e fushës së përcaktuar në skemë. Si mund të zgjidhet: - Riemërtoni titullin në burimin e të dhënave ose fushën e skemës - Nëse ky gabim duhet të shpërfillet, çaktivizoni `jo-matching-header` check in {validator}.

source: Extra Header
mk: Дополнително заглавие
sq: Titulli shtesë

source: There is an extra header in column {column_number}
mk: Постои дополнително заглавие во колната {column_number}
sq: Ekziston një titull shtesë në kolonën {column_number}

source: The first row of the data source contains header that doesn't exist in the schema. How it could be resolved: - Remove the extra column from the data source or add the missing field to the schema - If this error should be ignored disable `extra-header` check in {validator}.
mk: Првиот ред од изворот на податоци содржи заглавие кое не постои во шемата. Како може да се реши: - Отстранете ја дополнителната колона од изворот на податоци или додадете го полето што недостасува во шемата - Ако оваа грешка треба да се игнорира, оневозможете "extra-header" полето за избор во (validator).
sq: Rreshti i parë i burimit të të dhënave përmban titull i cili nuk ekziston në skemë. Si mund të zgjidhet: - Hiqni kolonën shtesë nga burimi i të dhënave ose shtoni fushën që mungon në skemën - Nëse ky gabim duhet të injorohet, çaktivizoni `extra-header` kontrollo në {validator}.

source: Missing Header
mk: Недостасува заглавие
sq: Mungon titulli

source: There is a missing header in column {column_number}
mk: Недостасува заглавие во колоната {column_number}
sq: Ka një titull që mungon në kolonën {column_number}

source: Based on the schema there should be a header that is missing in the first row of the data source. How it could be resolved: - Add the missing column to the data source or remove the extra field from the schema - If this error should be ignored disable `missing-header` check in {validator}.
mk: Врз основа на шемата треба да има заглавие кое недостасува во првиот ред од изворот на податоци. Како може да се реши: - Додајте ја колоната што недостасува во изворот на податоци или отстранете го дополнителното поле од шемата - Ако оваа грешка треба да се игнорира, оневозможете го `missing-header` полето за избор во {validator}.
sq: Bazuar në skemën duhet të ketë një titull i cili mungon në rreshtin e parë të burimit të të dhënave. Si mund të zgjidhet: - Shto kolonën e humbur në burimin e të dhënave ose hiqeni fushën shtesë nga skema - Nëse ky gabim duhet të injorohet, çaktivizoni 'missing-header` check in {validator}.

source: Type or Format Error
mk: Грешка во тип или формат
sq: Lloji ose Formati Gabim

source: The value {value} in row {row_number} and column {column_number} is not type {field_type} and format {field_format}
mk: Вредноста {value} во редот {row_number} и колоната {column_number} не е од тип {field_type} и формат {field_format}
sq: Vlera {vlera} në rresht {row_number} dhe kolona {column_number} nuk është lloji {field_type} dhe formati {field_format}

source: The value does not match the schema type and format for this field. How it could be resolved: - If this value is not correct, update the value. - If this value is correct, adjust the type and/or format. - To ignore the error, disable the `type-or-format-error` check in {validator}. In this case all schema checks for row values will be ignored.
mk: Вредноста не се совпаѓа со типот на шема и формат за ова поле. Како може да се реши: - Ако оваа вредност не е точна, ажурирајте ја вредноста. - Ако оваа вредност е точна, прилагодете го типот и/или форматот. - За да ја игнорирате грешката, оневозможете го `type-or-format-error` полето за избор во {validator}. Во овој случај сите проверки на шемата за вредностите на редот ќе бидат игнорирани.
sq: Vlera nuk përputhet me llojin dhe formatin e skemës për këtë fushë. Si mund të zgjidhet: - Nëse kjo vlerë nuk është e saktë, përditësoni vlerën. - Nëse kjo vlerë është e saktë, rregulloni llojin dhe/ose formatin. - Për ta injoruar gabimin, çaktivizoni `type-or-format-error` check-in {validator}. Në këtë rast të gjitha kontrollet e skemës për vlerat e rreshtit do të injorohen.

source: Required Constraint
mk: Задолжително ограничување
sq: Kufizimi i kërkuar

source: Column {column_number} is a required field, but row {row_number} has no value
mk: Колоната {column_number} е задолжително поле, но редот {row_number} нема вредност
sq: Kolona {column_number} është një fushë e kërkuar, por rreshti {row_number} nuk ka vlerë

source: This field is a required field, but it contains no value. How it could be resolved: - If this value is not correct, update the value. - If value is correct, then remove the `required` constraint from the schema. - If this error should be ignored disable `required-constraint` check in {validator}.
mk: Ова поле е задолжително поле, но не содржи вредност. Како може да се реши: - Ако оваа вредност не е точна, ажурирајте ја вредноста. - Ако вредноста е точна, тогаш отстранувајте го ограниченото `required` од шемата. - Ако оваа грешка треба да се игнорира, оневозможете "required-constraint" полето за избор во {validator}.
sq: Kjo fushë është një fushë e kërkuar, por nuk përmban asnjë vlerë. Si mund të zgjidhet: - Nëse kjo vlerë nuk është e saktë, përditësoni vlerën. - Nëse vlera është e saktë, atëherë hiqni nga skema kufizimin 'required'. - Nëse ky gabim duhet të injorohet, çaktivizoni 'kufizimet e kërkuara' në {validator}.

source: Pattern Constraint
mk: Ограничување во моделот
sq: Kufizimi i modelit

source: The value {value} in row {row_number} and column {column_number} does not conform to the pattern constraint of {constraint}
mk: Вредноста {value} во ред {row_number} и колона {column_number} не е во согласност со ограничувањето за моделот од {constraint}
sq: Vlera {vlera} në rresht {row_number} dhe kolona {column_number} nuk përputhet me kufizimet e modelit të {constraint}
