Repository: blagojabozinovski/ckanext-validation
Catalog: ckanext/validation/i18n/*/LC_MESSAGES/ckanext-validation.po
Languages: mk, sq

source: This field value should conform to constraint pattern. How it could be resolved: - If this value is not correct, update the value. - If value is correct, then remove or refine the `pattern` constraint in the schema. - If this error should be ignored disable `pattern-constraint` check in {validator}.
mk: Оваа вредност на полето треба да одговара на шаблонот за ограничување. Како може да се реши: - Ако оваа вредност не е точна, ажурирајте ја вредноста. - Ако вредноста е точна, тогаш отстранете ја или променете го `pattern` ограничувањето во шемата. - Ако оваа грешка треба да се игнорира оневозможете го `pattern-constraint` полето за избор во {validator}.
sq: Kjo vlerë e fushës duhet të jetë në përputhje me modelin e kufizimit. Si mund të zgjidhet: - Nëse kjo vlerë nuk është e saktë, përditësoni vlerën. - Nëse vlera është e saktë, atëherë hiqni ose përmirësoni kufizimet `pattern` në skemë. - Nëse ky gabim duhet të injorohet, çaktivizoni `constraint pattern` check in {validator}.

source: Unique Constraint
mk: Ограничување за единственост
sq: Kufizim unik

source: Rows {row_numbers} has unique constraint violation in column {column_number}
mk: Редовите {row_numbers} имаат единствена прекршување на ограничувањата во колоната {column_number}
sq: Rreshtat {row_numbers} kanë shkelje të kufizimeve unike në kolonën {column_number}

source: This field is a unique field but it contains a value that has been used in another row. How it could be resolved: - If this value is not correct, update the value. - If value is correct, then the values in this column are not unique. Remove the `unique` constraint from the schema. - If this error should be ignored disable `unique-constraint` check in {validator}.
mk: Ова поле е единствено поле, но содржи вредност што се користела во друг ред. Како може да се реши: - Ако оваа вредност не е точна, ажурирајте ја вредноста. - Ако вредноста е точна, тогаш вредностите во оваа колона не се единствени. Отстранете го ограничувањето на `unique` од шемата. - Ако оваа грешка треба да се игнорира, оневозможете ја `unique-constraint` полето за избор во {validator}.
sq: Kjo fushë është një fushë unike por përmban një vlerë që është përdorur në një rresht tjetër. Si mund të zgjidhet: - Nëse kjo vlerë nuk është e saktë, përditësoni vlerën. - Nëse vlera është e saktë, atëherë vlerat në këtë kolonë nuk janë unike. Hiqni detyrimin "unique" nga skema. - Nëse ky gabim duhet të injorohet, çaktivizoni `unique-constraint` check in {validator}.

source: Enumerable Constraint
mk: Избројливо ограничување
sq: Kufizim i shumëllojshëm

source: The value {value} in row {row_number} and column {column_number} does not conform to the given enumeration: {constraint}
mk: Вредноста {value} во ред {row_number} и колона {column_number} неодговара на даденото избројување од: {constraint}
sq: Vlera {vlera} në rresht {row_number} dhe kolona {column_number} nuk përputhet me numërimin e dhënë: {constraint}

source: This field value should be equal to one of the values in the enumeration constraint. How it could be resolved: - If this value is not correct, update the value. - If value is correct, then remove or refine the `enum` constraint in the schema. - If this error should be ignored disable `enumerable-constraint` check in {validator}.
mk: Оваа вредност на полето треба да биде еднаква на една од вредностите во ограничувањето во избројувањето. Како може да се реши: - Ако оваа вредност не е точна, ажурирајте ја вредноста. - Ако вредноста е точна, тогаш отстранете ја или поправете го `enum` ограничувањето во шемата. - Ако оваа грешка треба да се игнорира, оневозможете го `enumerable-constraint` полето за избор во {validator}.
sq: Kjo vlerë në fushë duhet të jetë e barabartë me një nga vlerat në kufizimet e regjistrimit. Si mund të zgjidhet: - Nëse kjo vlerë nuk është e saktë, përditësoni vlerën. - Nëse vlera është e saktë, atëherë hiqni ose përmirësoni kufizimin `enum` në skemë. - Nëse ky gabim duhet të shpërfillet, çaktivizoni `enumerable-constraint` check in {validator}.

source: Minimum Constraint
mk: Минимално ограничување
sq: Kufizimi minimal

source: The value {value} in row {row_number} and column {column_number} does not conform to the minimum constraint of {constraint}
mk: Вредноста {value} во ред {row_number} и колона {column_number} неодговара на минималното ограничување од {constraint}
sq: Vlera {vlera} në rresht {row_number} dhe kolona {column_number} nuk përputhet me kufizimet minimale të {constraint}

source: This field value should be greater or equal than constraint value. How it could be resolved: - If this value is not correct, update the value. - If value is correct, then remove or refine the `minimum` constraint in the schema. - If this error should be ignored disable `minimum-constraint` check in {validator}.
mk: Оваа вредност на полето треба да биде поголема или еднаква од ограничувањето. Како може да се реши: - Ако оваа вредност не е точна, ажурирајте ја вредноста. - Ако вредноста е точна, тогаш отстранете ја или поправете го `minimum` ограничувањето вошемата. - Ако оваа грешка треба да се игнорира, оневозможете го `minimum-constraint` полето за избор во {validator}.
sq: Kjo vlerë e fushës duhet të jetë më e madhe ose e barabartë sesa vlera kufizuese. Si mund të zgjidhet: - Nëse kjo vlerë nuk është e saktë, përditësoni vlerën. - Nëse vlera është e saktë, atëherë hiqni ose përsosni kufizimet 'minimum' në skemë. - Nëse ky gabim duhet të injorohet, çaktivizoni 'minimum-constraint` check in {validator}.

source: Maximum Constraint
mk: Максимално ограничување
sq: Kufizimi minimal

source: The value {value} in row {row_number} and column {column_number} does not conform to the maximum constraint of {constraint}
mk: Вредноста {вредност} во ред {ред_број} и колона {column_number} неодговара на максималното ограничување на {ограничување}
sq: Vlera {vlera} në rresht {row_number} dhe kolona {column_number} nuk përputhet me kufizimet maksimale të {constraint}

source: This field value should be less or equal than constraint value. How it could be resolved: - If this value is not correct, update the value. - If value is correct, then remove or refine the `maximum` constraint in the schema. - If this error should be ignored disable `maximum-constraint` check in {validator}.
mk: Оваа вредност на полето треба да биде помала или еднаква од ограничувањето. Како може да се реши: - Ако оваа вредност не е точна, ажурирајте ја вредноста. - Ако вредноста е точна, тогаш отстранете ја или поправете го `максимум` ограничувањето вошемата. - Ако оваа грешка треба да се игнорира, оневозможете го `maximum-constraint` полето за избор во {validator}.
sq: Kjo vlerë e fushës duhet të jetë më pak ose e barabartë sesa vlera kufizuese. Si mund të zgjidhet: - Nëse kjo vlerë nuk është e saktë, përditësoni vlerën. - Nëse vlera është e saktë, atëherë hiqni ose përsosni kufizimet 'maximum' në skemë. - Nëse ky gabim duhet të injorohet, çaktivizoni `maximum-constraint` check in {validator}.

source: Minimum Length Constraint
mk: Ограничување на минимална должина
sq: Kufizimi maksimal i kohëzgjatjes

source: The value {value} in row {row_number} and column {column_number} does not conform to the minimum length constraint of {constraint}
mk: Вредноста {value} во ред {row_number} и колона {column_number} неодговара на минималното ограничување на должината од {constraint}
sq: Vlera {vlera} në rresht {row_number} dhe kolona {column_number} nuk përputhet me kufizimin minimal të gjatësisë së {constraint}

source: A lenght of this field value should be greater or equal than schema constraint value. How it could be resolved: - If this value is not correct, update the value. - If value is correct, then remove or refine the `minimumLength` constraint in the schema. - If this error should be ignored disable `minimum-length-constraint` check in {validator}.
mk: Должина на ова поле вредност треба да биде поголема или еднаква од ограниченатавредност на шемата. Како може да се реши: - Ако оваа вредност не е точна, ажурирајте ја вредноста. - Ако вредноста е точна, тогаш отстранете ја или поправете ограничувањето за `minimumLength` во шемата. - Ако оваа грешка треба да се игнорира, оневозможете го `minimum-length-constraint` во полето за избор во {validator}.
sq: Gjatësia e kësaj vlere në terren duhet të jetë më e madhe ose e barabartë sesa vlera e kufizimit të skemës. Si mund të zgjidhet: - Nëse kjo vlerë nuk është e saktë, përditësoni vlerën. - Nëse vlera është e saktë, atëherë hiqni ose përsosni kufizimin `minimumLength` në skemë. - Nëse ky gabim duhet të injorohet, çaktivizoni 'minimum-length-constraint` check in {validator}.

source: Maximum Length Constraint
mk: Ограничување на максимална должина
sq: Kufizimi maksimal i kohëzgjatjes

source: The value {value} in row {row_number} and column {column_number} does not conform to the maximum length constraint of {constraint}
mk: Вредноста {value} во ред {row_number} и колона {column_number} неодговара на максималното ограничување на должината од {constraint}
sq: Vlera {vlera} në rresht {row_number} dhe kolona {column_number} nuk përputhet me kufizimin maksimal të gjatësisë së {constraint}

source: A lenght of this field value should be less or equal than schema constraint value. How it could be resolved: - If this value is not correct, update the value. - If value is correct, then remove or refine the `maximumLength` constraint in the schema. - If this error should be ignored disable `maximum-length-constraint` check in {validator}.
mk: Должина на оваа вредност на полето треба да биде помала или еднаква од ограниченатавредност на шемата. Како може да се реши: - Ако оваа вредност не е точна, ажурирајте ја вредноста. - Ако вредноста е точна, тогаш отстранете ја или поправете го органичувањето за `maximumLength` во шемата. - Ако оваа грешка треба да се игнорира, оневозможете `maximum-length-constraint` во полето за избор во {validator}.
sq: Një gjatësi e kësaj vlere në terren duhet të jetë më e ulët ose e barabartë sesa vlera e kufizimit të skemës. Si mund të zgjidhet: - Nëse kjo vlerë nuk është e saktë, përditësoni vlerën. - Nëse vlera është e saktë, atëherë hiqni ose përsosni kufizimin `maximumLength` në skemë. - Nëse ky gabim duhet të injorohet, çaktivizoni `maximum-length-constraint` check in {validator}.

source: You can pass a JSON object of validation options. See <a href="https://github.com/frictionlessdata/ckanext-validation#validation-options">here</a> for more information.
mk: Можете да ставите JSON објект кој содржи опции за валидација. Погледнете <a href="https://github.com/frictionlessdata/ckanext-validation#validation-options">тука</a> за повеќе информации.
sq: Ju mund të kaloni një objekt JSON të opsioneve të validimit. Shikoni <a href="https://github.com/frictionlessdata/ckanext-validation#validation -options"> këtu </a> për më shumë informacion.

source: Validation Report
mk: Извештај од валидација
sq: Raporti i Validimit

source: Validation timestamp
mk: Временска ознака од валидација
sq: Vlefshmëria e validimit

source: Duration
mk: Времетраење
sq: Kohëzgjatja

source: Data Validation Report
mk: Извештај од валидација на податоци
sq: Raporti i Validimit të të Dhënave

source: Table inspection has reached 1000 row(s) limit
sq: Inspektimi i tabelës ka arritur një kufi prej 1000 rreshtave

source: Row {row_number} has an extra value in column {column_number}
sq: Rreshti {row_number} ka një vlerë shtesë në kolonën {column_number}
